app/controllers/results_controller.rb

  def index
    @place = if params[:id]
      Location.where('id in (?)', params[:id].split(','))
    else
      Location.all
    end

    @score = if params[:id]
      Score.where('id in (?)', params[:id].split(','))
    else
      Score.all
---
SELECT "locations".* FROM "locations"
SELECT "scores".* FROM "scores"